/*---------------------------------------------------------------------------*
  Project:  Horizon
  File:     gd_Texture.h

  Copyright (C)2011 Nintendo Co., Ltd.  All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law. They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

 *---------------------------------------------------------------------------*/
#ifndef NN_GD_CTR_GD_TEXTURE_H_
#define NN_GD_CTR_GD_TEXTURE_H_

#include <limits>
#include <nn/gd/CTR/gd_Types.h>
#include <nn/gd/CTR/gd_Result.h>
#include <nn/gd/CTR/gd_Utils.h>

#include <nn/gd/CTR/gd_Memory.h>
#include <nn/gd/CTR/gd_Resource.h>

#include <nn/dbg/dbg_DebugString.h>

#if NN_GD_DOCUMENT_TYPE == ENGLISH
/* Please see man pages for details 
    
*/
#else
/* Please see man pages for details 
    
*/
#endif

namespace nn {
namespace gd {
namespace CTR {


/*********************************************************************************************************/
/********************************************** Internal data ********************************************/
class TextureStage;
class CombinerStage;
class ProceduralTextureStage;
class VertexInputStage;
namespace internal
{

class TextureStage;
class LightingStage;
class CombinerStage;
class VertexInputStage;
class ProceduralTextureSettings
{
private:
    u32 m_Proctex0;  // 0xa8
    u32 m_Proctex1;  // 0xa9
    u32 m_Proctex2;  // 0xaa
    u32 m_Proctex3;  // 0xab
    u32 m_Proctex4;  // 0xac
    u32 m_Proctex5;  // 0xad

    u32 m_PaddingEndStruct;
    u32 m_DirtyFieldMask;

    enum
    {
        PTMASK_PROCTEX0 = 1 << 0,
        PTMASK_PROCTEX1 = 1 << 1,
        PTMASK_PROCTEX2 = 1 << 2,
        PTMASK_PROCTEX3 = 1 << 3,
        PTMASK_PROCTEX4 = 1 << 4,
        PTMASK_PROCTEX5 = 1 << 5,

        PTMASK_REGISTRY_COUNT = 6
    };

friend class nn::gd::CTR::internal::TextureStage;
friend class nn::gd::CTR::ProceduralTextureStage;
friend class nn::gd::CTR::TextureStage;
};  // ProceduralTextureSettings

class TextureSettings
{
private:
    u32 m_TextureUnitControl;  // 0x80

    //used by sampler states
    u32 m_FormatTextureUnit0; //0x83
    u32 m_FormatTextureUnit1; //0x93
    u32 m_FormatTextureUnit2; //0x9b
    u32 m_MipLevelsTextureUnit0; //0x84
    u32 m_MipLevelsTextureUnit1; //0x94
    u32 m_MipLevelsTextureUnit2; //0x9c
    u32 m_TypeTextureUnit0; //0x83
    u32 m_ShadowTextureSetting; //0x8b

    u32 m_ProcTexHardwareEnabled;
    u32 m_DirtyFieldMask;

    enum
    {
        TXMASK_SEND_TEXTURE_UNIT_CONTROL = 1 << 0,
        TXMASK_UPDATE_TEXTURE_UNIT_CONTROL = 1 << 0 | 1 << 1,
        TXMASK_UPDATE_TEXTURE_SHADOW_SETTINGS = 1 << 2
    };

friend class nn::gd::CTR::ProceduralTextureStage;
friend class nn::gd::CTR::internal::TextureStage;
friend class nn::gd::CTR::CombinerStage;
friend class nn::gd::CTR::TextureStage;
friend class nn::gd::CTR::internal::CombinerStage;
friend class nn::gd::CTR::internal::LightingStage;
friend class nn::gd::CTR::VertexInputStage;
friend class nn::gd::CTR::internal::VertexInputStage;
};  // TextureSettings

#if NN_GD_DOCUMENT_TYPE == ENGLISH
/* Please see man pages for details */
#else
/* Please see man pages for details */
#endif
extern ProceduralTextureSettings g_proceduralTexture;

#if NN_GD_DOCUMENT_TYPE == ENGLISH
/* Please see man pages for details */
#else
